Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: [ZBX-2982] added IP and port of Zabbix server in dashboard widget "Status of Zabbix"
ja: [ZBX-2982] ダッシュボードの「Zabbixサーバの状態」にZabbixサーバのIPアドレスとポート番号を追加

source: No new functionality will be added in new betas.
ja: 以降のベータ版では機能の新規追加は行いません。

source: [ZBX-2803] fixed agent compilation on HP-UX with the native HP-UX C compiler
ja: [ZBX-2803] HP-UX純正のCコンパイラを利用してエージェントをコンパイルできるよう修正

source: fixed problem with libresolv under Solaris 8
ja: Solaris 8のlibresolvの問題を修正

source: Added support of vfs.dev.read/write under FreeBSD.
ja: FreeBSDにアイテムvfs.dev.read/writeを追加。

source: [DEV-50] improved validation of incoming parameters
ja: [DEV-50] 入力パラメータのバリデーション処理を改善

source: [ZBX-2833] fixed JS error in monitoring events screen
ja: [ZBX-2833] 監視データのイベント画面のJSエラーを修正

source: What's New in 1.5.3 (beta)
ja: ZABBIX 1.5.3 (beta)の変更点

source: [ZBX-2006] added explicit dependency on "lber" library to gain better portability on upcoming Fedora "ld" changes.
ja: [ZBX-2006] 次期Fedoraの「ld」変更に対してよりよい移植性を実現するために「lber」ライブラリに対する明確な依存を追加。

source: [ZBX-3514] removed non "regexp" triggers from item log-form menu
ja: [ZBX-3514] logフォームのメニューから正規表現ではないトリガーを削除

source: [ZBX-2002] refresh timer is now restarted instead of stopped when checkbox is checked
ja: [ZBX-2002] チェックボックスをチェックした際にリフレッシュタイマーを停止する代わりに再度カウントし直すように修正

source: [ZBX-968] added dropdown with time periods for IT services
ja: [ZBX-968] ITサービスに期間のドロップダウンを追加

source: Distributed monitoring: fixed deadlocks
ja: 分散モニタリング: デッドロックの問題を修正

source: [ZBX-2524] fixed deleting media types
ja: [ZBX-2524] メディアタイプの削除処理の問題を修正

source: Feature freeze will be announced after release of 1.3.5.
ja: 1.3.5のリリース後に、機能の凍結を行います。

source: [DEV-456] added filter to dashboard
ja: [DEV-456] ダッシュボードにフィルターを追加

source: [ZBX-4216] fixed weekdays in Brazilian Portuguese translation; thanks to Ricardo Santos
ja: [ZBX-4216] weekdaysのブラジル系ポルトガル語翻訳を修正; Ricardo Santosに感謝

source: improved support of numeric performance counters for Windows agents
ja: Windowsエージェントの、数値で示されるパフォーマンスカウンタの改善

source: [ZBX-3988] fixed memory leak in dashboard
ja: [ZBX-3988] ダッシュボードのメモリリークを修正

source: corrected some typos in misc/conf/zabbix_server.conf
ja: misc/conf/zabbix_server.confのいくつかの表記間違いを修正

source: added transaction functionality to frontend
ja: フロントエンドの翻訳機能の追加

source: [ZBX-618] fixed cast problem with oracle9
ja: [ZBX-618] oracle9のcastの問題を修正

source: [ZBXNEXT-586] added sensor[device,sensor,] check for Linux 2.4
ja: [ZBXNEXT-586] Linux 2.4にsensor[device,sensor,<mode>]チェックを追加

source: ignore trigger FALSE state if it depends on another trigger
ja: 他のトリガーに依存している場合、トリガーのFALSE状態を無視するように修正

source: [ZBX-1786] fixed not remembered group when using paging in export screen
ja: [ZBX-1786] エクスポート画面でページを変更した際、グループの選択が記録されない問題を修正

source: [ZBX-2258] fixed applications import
ja: [ZBX-2258] アプリケーションのインポートを修正

source: [ZBX-2754] fixed possible undefined variables in frontend
ja: [ZBX-2754] Webインターフェイスでundefined variablesエラーが表示される問題を修正

source: [ZBX-2690] added validation for screens xml
ja: [ZBX-2690] スクリーンのxml処理にバリデーションを追加

source: [ZBX-2553] fixed simple checks ignoring server replies
ja: [ZBX-2553] シンプルチェックがサーバのリプライを無視する問題を修正

source: [ZBX-635] improved escalations to stop if host, item or trigger is disabled
ja: [ZBX-635] ホスト、アイテム、トリガーが無効の場合にエスカレーションを停止するように改善

source: [ZBX-1396] fixes in map element selection
ja: [ZBX-1396] マップの要素の選択を修正

source: [ZBX-889] fixed possible bug in media types form
ja: [ZBX-889] メディアタイプのフォームの問題を修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.5rc1 (First Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.5rc1 (1番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-708] DM: fixed possible server crash while synchronizing events between nodes
ja: [ZBX-708] ノード間のイベントの同期中にサーバがクラッシュする問題を修正

source: [DEV-457] improvements in dynamic map link indicators form
ja: [DEV-457] 動的に表示されるマップのリンクインジケーターのフォームを改善

source: [ZBX-519] removed proxy hosts from applications hosts list
ja: [ZBX-519] アプリケーションホストのリストからプロキシホストを削除

source: [ZBX-78] fixed detection of net-snmp libs
ja: [ZBX-78] net-snmp libsの検出を修正

source: Zabbix Agents have been compiled and tested on the following platforms:
ja: Zabbixエージェントは以下のプラットフォームでコンパイルとテストを行っています。

source: [ZBXNEXT-408] added zabbix[process,...] internal checks
ja: [ZBXNEXT-408] 内部チェックにzabbix[process,...]を追加

source: Advanced support of maintenance periods
ja: メンテナンス期間のサポートの改善

source: [ZBXNEXT-448] added trigger function logeventid that matches the last event ID to a regex
ja: [ZBXNEXT-448] 正規表現で最後のイベントIDとの一致を調べるトリガー関数logeventidを追加

source: This document contains the release notes for Zabbix 1.8.8rc3.
ja: このドキュメントはZabbix 1.8.8rc3のリリースノートを含みます。

source: Improved front-end to show data from multiple nodes
ja: 複数ノードのデータを表示できるようにフロントエンドを改善

source: [ZBX-4045] removed the check for duplicate hosts, made the server survive the situation instead
ja: [ZBX-4045] ホストの重複チェックを削除し、サーバがクラッシュしないように修正

source: [ZBX-1328] improved host group mass deletion caption
ja: [ZBX-1328] ホストグループの一括削除の説明文を改善

source: [ZBX-2657] fixed bugs with non closing item select popups in bar reports
ja: [ZBX-2657] バーレポート画面でアイテムの選択ポップアップが閉じない問題を修正

source: [ZBX-1022] fixed syntax in parameter 'continue_pending' in services[] key
ja: [ZBX-1022] service[]キーのパラメータ「continue_pending」の表記間違いを修正

source: [ZBX-2225] complete rewrite of the server code for template linkage
ja: [ZBX-2225] Zabbixサーバのテンプレートリンク処理のコードを完全に書き換え

source: [ZBX-294,ZBX-296] Oracle related fixes
ja: [ZBX-294,ZBX-296] Oracleに関係するいくつかの修正

source: No feature freeze is announced yet.
ja: まだ機能のフリーズは行われていません。

source: [ZBX-69] eliminated compilation warnings "_GNU_SOURCE redefined"
ja: [ZBX-69] コンパイル時のワーニング"_GNU_SOURCE redefined"を削除

source: [ZBX-2819] fixed showing trends for symbolic items
ja: [ZBX-2819] 符号付きのアイテムのトレンドの表示を修正

source: [ZBX-2759] fixed item form not saving params field
ja: [ZBX-2759] アイテムのフォームでパラメータのフィールドが保存されない問題を修正

source: [ZBX-779] removed PostgreSQL warning message "nonstandard use of ..."
ja: [ZBX-779] PostgreSQLの警告メッセージ「nonstandard use of ...」を削除

source: [ZBX-218] fixed problem "Unable to add performance counter" on start of win agent
ja: [ZBX-218] Windowsエージェント起動時の「Unable to add performance counter」問題を修正

source: [ZBX-4145] fixed images import script for PostgreSQL 9.1 and above
ja: [ZBX-4145] PostgreSQL 9.1以上のイメージインポートスクリプトを修正

source: [ZBX-2639] added net.if.total and net.if.list items in the help_items table
ja: [ZBX-2639] help_itemsテーブルにnet.if.totalとnet.if.listアイテムを追加

source: This document contains the release notes for Zabbix 1.8.8rc2.
ja: このドキュメントはZabbix 1.8.8rc2のリリースノートを含みます。

source: [ZBX-3733] make possible to save Device uniqueness criteria status (discovery rule) in cloning event
ja: [ZBX-3733] ディスカバリルールのコピー時にデバイスの固有性を特定する基準の設定を保存できるように修正

source: [ZBX-2441] fixed handling of begin/commit/rollback statements with temporarily unavailable SQL server
ja: [ZBX-2441] データベースとの接続が一時的に行えない場合のbegin/commit/rollbackステートメントの処理を修正

source: [ZBX-1715] fixed errors in IT Services parent selection sceren
ja: [ZBX-1715] ITサービスの親を選択した画面のエラーを修正

source: This document contains the release notes for ZABBIX 1.6.
ja: このドキュメントはZABBIX 1.6のリリースノートを含みます。

source: This release fixes numerous issues of Zabbix 1.8.
ja: このリリースにはZabbix 1.8のいくつかの修正が含まれます。

source: [ZBX-1938] fixed permission check inefficiency in charts
ja: [ZBX-1938] グラフの非効率な権限チェックを修正

source: [ZBX-3461] fixed names of IPMI pollers in debug output and the number of items they take
ja: [ZBX-3461] デバッグ出力のIPMI pollerの名前、およびそれらが取得するアイテム数を修正

source: [ZBX-2160] fixed permission issue in reports when accessing by user or admin
ja: [ZBX-2160] ZabbixユーザまたはZabbix管理者がレポート画面にアクセスした際に発生する権限の問題を修正

# [ZBX-160] fixed web.page.get to send instead of
source: [ZBX-160] fixed web.page.get to send \r\n instead of \n
ja: [ZBX-160] web.page.getが\nではなく\r\nを送信するように修正

source: [ZBX-1945] speed improvement for synchronization between nodes
ja: [ZBX-1945] ノード間の同期速度を改善

source: See the Installation Guide http://www.zabbix.com/manual/v1.1/install.php for full details.
ja: インストールの詳細は、インストレーションガイドを参照してください。http://www.zabbix.com/manual/v1.1/install.php

source: [ZBX-1930] all top indents of icon labels now is equal
ja: [ZBX-1930] アイコンラベルが先頭行インデントに合わせて均等に表示されるように修正

source: [ZBX-3086] fixed errors when edit hostgroup linkage for hosts and templates
ja: [ZBX-3086] ホストとテンプレートがリンクされている場合にホストグループ編集時のエラーを修正

source: [ZBX-641] fixed oracle OCI-Lob parse
ja: [ZBX-641] OracleのOCI-Lobの構文解析の問題を修正

source: Number of unacknowledged triggers can be optionally displayed in the Dashboard.
ja: ダッシュボードに障害対応コメントが入力されていないトリガーの数を表示するオプションを追加しました。

source: fixed e-mail sending to the pedantic qmail
ja: qmailへのメール送信を修正

source: [ZBX-507] made UserParameters work with zabbix_agent(d) -p and -t
ja: [ZBX-507] ユーザーパラメータに登録した項目もzabbix_agent(d)で-pと-tオプションで使用できるように修正

source: [ZBX-827] fixed possible bug in actions hints
ja: [ZBX-827] アクションのヒントの既知のバグを修正

source: [DEV-399] added information about monitored hosts to the discovery screen
ja: [DEV-399] ディスカバリ画面に監視対象ホストについての情報を追加

source: [ZBX-2153] fixed server crash due to unaligned memory access
ja: [ZBX-2153] 境界を跨いだメモリアクセスよりサーバがクラッシュする問題を修正

source: Templates may contain screens for easy maintenance.
ja: テンプレートにスクリーン設定を含めることができ、メンテナンスが容易になります。

source: fixed latest data auto-refresh cripples filter viewing issue
ja: 最新データ画面の自動更新によってフィルタ表示が無効になってしまう問題を修正

source: [ZBX-3443] fixed "not selected" working as "all" in Monitoring->Events
ja: [ZBX-3443] 監視データ -> イベント画面で「選択されていない」状態が「すべて」の状態と同じ動作になっていた問題を修正

source: No upgrade script are provided for migration from 1.1.x.
ja: ZABBIX 1.1.xからのアップグレードスクリプトは用意されていません。

source: Support of template, host and global-level macros
ja: テンプレート、ホスト、グローバルレベルのマクロのサポート

source: [ZBX-4087] fixed error message when processing configuration file
ja: [ZBX-4087] 設定ファイル処理時のエラーメッセージを修正

source: [ZBX-2685] fixed map elements not always change position when coords are manually set
ja: [ZBX-2685] マップのアイコンを手動で動かした場合に位置が変わらないことがある問題を修正

source: Execute a database patch if migrating from Zabbix 1.6.x.
ja: Zabbix 1.6.xからマイグレーションする場合はデータベースのパッチ適用を行ってください。

source: [DEV-137] add basic bootstrap script
ja: [DEV-137] 基本的なブートストラップスクリプトを追加

source: [ZBX-2647] made some of hard coded strings translatable
ja: [ZBX-2647] ハードコーディングされていたいくつかの文字列を翻訳できるように修正

source: Improved User Permission Schema
ja: ユーザ権限スキーマの改善

source: Added database index
ja: データベースへのインデックスの追加により

source: [ZBX-1373] fixed auto discovery by proxy module
ja: [ZBX-1373] プロキシモジュールによるオートディスカバリの問題を修正

source: [ZBX-2585] removed spaces from charts title & fixed date format for chart4.php
ja: [ZBX-2585] cchart4.phpのグラフタイトルから空白を削除し、時刻のフォーマットを修正

source: [ZBX-2862] it is now not possible to delete host group or user group used in scripts
ja: [ZBX-2862] スクリプト設定で使用しているホストグループやユーザグループを削除できないように修正

source: [ZBX-974] recompressed png images with pngcrush.
ja: [ZBX-974] pngcrushを利用してPNG画像を再圧縮。

source: This document contains the release notes for ZABBIX 1.3.
ja: このドキュメントはZABBIX 1.3のリリースノートです。

source: [ZBX-149] fixed incorrect processing of vm.memory.size key in FreeBSD
ja: [ZBX-149] FreeBSDのvm.memory.sizeの間違った処理を修正

source: [ZBX-1608] fixed notifications after maintenance periods
ja: [ZBX-1608] メンテナンス期間終了後の通知を修正

source: This release fixes known issues of Zabbix 1.8.x and introduces new minor features.
ja: このリリースにはZabbix 1.8.xのいくつかの修正と新機能の紹介が含まれます。

source: See Zabbix Manual for full details.
ja: 詳細はZABBIXマニュアルを参照してください。

source: [ZBX-2749] fixed agent crash in web.page.regexp[] on very long matched fragments
ja: [ZBX-2749] web.page.regexp[]利用時にとても長い文字列に一致した場合にエージェントがクラッシュする問題を修正

source: [ZBX-1897] include CREDITS file in distribution package
ja: [ZBX-1897] 配布パッケージにCREDITSファイルを追加

source: DNS hostname can be used in parameter Server.
ja: ServerパラメータにDNSホスト名を利用することができます。

source: [ZBX-1596] fixed checking of allowed hosts for data sent by zabbix_sender
ja: [ZBX-1596] zabbix_senderによって送信されたデータが許可されたホストかどうかのチェック処理を修正

source: [ZBX-1986] fixed empty Y axis if item values are zeros
ja: [ZBX-1986] アイテム値がゼロの場合にY軸に何も表示されない問題を修正

source: changed disabled auto-logout indication
ja: 無効状態の自動ログアウトの表示を変更

source: Fixed problem with node syncing
ja: ノード同期の問題を修正

source: Multiple network interfaces can be assigned to a single host, therefore one host may have several IP addresses with different checks for each IP.
ja: 1つのホストに複数のネットワークインターフェイスを割り当てることができます。これによりそれぞれのIPアドレスに対して異なるチェックを行うことが可能です。

source: [DEV-326] admins are allowed to change Medias in user profile
ja: [DEV-326] 管理者はユーザプロファイルからメディアを変更可能

source: [ZBX-3547] Rewrote performance counters and CPU stats collection for Windows
ja: [ZBX-3547] WindowsのパフォーマンスカウンタとCPU状態取得の処理を修正

source: [ZBX-2370] fixed duration value in monitoring events for multiple problem triggers
ja: [ZBX-2370] 複数の障害が発生したトリガーについてイベント画面の継続期間の問題を修正

source: [ZBX-1442] when linking objects during map editing, link "apply" does not close the form any more
ja: [ZBX-1442] マップ編集画面でオブジェクトのリンクを張る際に「適用」を押してもフォームをクローズしないように修正

source: [ZBX-2823] updated Russian translation; thanks to Pustovalov Alexey
ja: [ZBX-2823] ロシア語翻訳を改善; Pustovalov Alexeyに感謝

source: In you are using Zabbix 1.8 with node-based distributed setup, please run the following SQL patch.
ja: Zabbix 1.8でノード構成の分散監視を利用している場合、以下のSQLパッチを実行してください。

source: [ZBX-1357] update Hungarian translation; thanks to Laszlo Szabo
ja: [ZBX-1357] ハンガリー語訳を更新; Laszlo Szaboに感謝

source: This document contains the release notes for ZABBIX 1.4.
ja: このドキュメントはZABBIX 1.4のリリースノートを含みます。

source: [ZBX-133] added more debug information on semaphore related errors
ja: [ZBX-133] セマフォに関係するエラーのより詳細なデバッグ情報を追加

source: [ZBX-3072] fixed MySQL error when shutting down server
ja: [ZBX-3072] サーバシャットダウン時のMySQLエラーを修正

source: This document contains the release notes for Zabbix 1.7.1.
ja: このドキュメントはZABBIX 1.7.1のリリースノートを含みます。

source: [ZBX-2452] fixed parsing of integer values from SNMP's Hex-STRING
ja: [ZBX-2452] SNMPのHex-STRINGの整数値の構文解析の問題を修正

source: numerous bug fixes and minor improvements
ja: 多数のバフフィックスとマイナーな改善

source: [ZBX-2461] fixed complex bugs with trigger expressions
ja: [ZBX-2461] トリガー条件式の複合的なバグを修正

source: If you are migrating from 1.8.x the option will be off by default.
ja: 1.8.xからマイグレーションを行った場合、このオプションはデフォルトで無効になります。

source: [DEV-195] added support of source ip address
ja: [DEV-195] ソースIPアドレス指定のサポートを追加

source: ZABBIX is an enterprise-class open source distributed monitoring solution.
ja: ZABBIXはオープンソースで配布されるエンタープライズモニタリングソリューションです。

source: [ZBX-3504] added a text notification in the maps section when no maps are defined
ja: [ZBX-3504] マップ設定が無い時にマップ画面にテキストによる通知を追加

source: ZABBIX Agents
ja: ZABBIXエージェント

source: [ZBX-2285] fixed sending of active items multiple times
ja: [ZBX-2285] アクティブアイテムが複数回送信される問題を修正

source: [ZBX-1582] fixed processing ssh.run[...] check to avoid the server crashing on libssh2 timeout
ja: [ZBX-1582] libssh2のタイムアウトによるサーバのクラッシュを回避するためにssh.run[...]の処理を修正

source: Time picker was extended to have better user friendly interface.
ja: タイムピッカーがよりユーザが操作しやすいインターフェースになるように拡張されました。

source: Advanced maps
ja: マップの改善

source: [ZBX-2315] fixed multiple issues with JS scrollbar
ja: [ZBX-2315] JSスクロールバーの複数の問題を修正

source: [ZBX-1729] removed limitation of showings triggers in charts only by one item
ja: [ZBX-1729] アイテムが1つの場合だけ行えたグラフのトリガー表示の制限を解除

source: Advanced cache module is introduced to significantly improve performance of Zabbix Server and Proxy operations.
ja: 改善されたキャッシュモジュールはZabbixサーバとプロキシの動作のパフォーマンスを著しく改善します。

source: [ZBX-1419] improve and fix database upgrade patches for older versions
ja: [ZBX-1419] 旧バージョン用のデータベースアップグレードパッチの改善と修正

source: [ZBX-897] fixed user groups rights adding for host groups
ja: [ZBX-897] ホストグループへユーザグループ権限を追加する処理を修正

source: [ZBX-2219] fixed graphs data in data.sql
ja: [ZBX-2219] data.sqlのグラフデータを修正

source: [ZBX-1876] added remarks to configuration files of Zabbix server and proxy about fping6
ja: [ZBX-1876] Zabbixサーバとプロキシの設定ファイルにfping6についての注釈を追加

source: [ZBX-3744] updated Japanese translation; thanks to Kodai Terashima
ja: [ZBX-3744] 日本語翻訳を更新; Kodai Terashimaに感謝

source: Better item parameters
ja: より良いアイテムのパラメータ

source: added support of directories for Include in configuration file
ja: 設定ファイルにIncludeパラメータを追加

source: Please, see ChangeLog for complete list of changes.
ja: 変更点の詳細はChangeLogを参照してください。

source: Zabbix is released under the GPL, thus it is free of charge for both commercial and non-commercial use.
ja: ZabbixはGPLライセンスの元で配布されているため、商用、非商用問わず無償で利用することができます。

source: [ZBXNEXT-194] added host status widget to dashboard
ja: [ZBXNEXT-194] ダッシュボードにホストステータスウィジットを追加

source: In addition to standart host name, visible host name can be set to be displayed everywhere in the front-end.
ja: 通常のホスト名に加えて、Webインターフェースで表示するために利用できる表示名を設定することができます。

source: [ZBX-2488] changed filter from Web Monitoring to External Check
ja: [ZBX-2488] Web監視のアイテムのフィルタ項目を外部チェックへ変更

source: [ZBX-3267] fixed trigger updating through API
ja: [ZBX-3267] APIを利用したトリガーの更新を修正

source: The following sections describe the release in detail and provide late-breaking or other information that supplements its main documentation.
ja: 以下にリリースの詳細を示します。これは最新の情報を提供し、主要なドキュメントの補足となります。

source: Remembering of map grid options
ja: マップグリッドオプションの保存

source: [ZBX-3104] implemented the screen item API
ja: [ZBX-3104] スクリーンアイテムのAPIを実装

source: [ZBX-2914] add Ubuntu upstart files; thanks to S. Canchon
ja: [ZBX-2914] Ubuntu用upstartファイルを追加; S. Canchonに感謝

source: changed greeting message
ja: グリーティングメッセージを変更

source: ZABBIX is an all-in-one 24x7 monitoring solution without high cost.
ja: ZABBIXは低コストで24時間365日稼働を実現する監視ソリューションです。

source: [ZBX-954] fixed item property reference when adding log item with type other than "log"
ja: [ZBX-954] データ型が「ログ」以外のログアイテムを追加した際にアイテムのプロパティの参照を修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.4rc3 (Third Release Candidate).
ja: Zabbix SIAはZabbix 1.8.4rc3 (3番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: improved performance on disabling/enabling, deleting hosts
ja: ホストの無効化、有効化、削除のパフォーマンスの改善

source: Added direct SNMP trap monitoring
ja: SNMPトラップ監視機能の追加

source: [ZBX-1287] fixed operations with user medias
ja: [ZBX-1287] ユーザのメディア設定の操作の問題を修正

source: fixed "values per second" having too many decimal places
ja: 「秒あたりの値」の小数点以下の桁数が多すぎる問題を修正

source: [ZBX-1346] clarify some parameter values in the example configuration files
ja: [ZBX-1346] サンプルの設定ファイルのパラメータ値を整理

source: default number of HTTP pollers was decreased to one
ja: HTTP pollerのデフォルト数を1に設定

source: [ZBX-4377] fixed error message when checking if libcurl can be linked statically
ja: [ZBX-4377] libcurlを静的にリンク可能かチェックする際のエラーメッセージを修正

source: The interface is tested to support very large number of monitored elements with very low impact on overall system performance.
ja: このインターフェースはシステム全体のパフォーマンスに影響を与えずに多数のホストの監視を行うことができるようにテストを行っています。

source: [ZBX-2767] fixed time stamp in german locales
ja: [ZBX-2767] ドイツ語環境での時刻表示を修正

source: [ZBX-1598] fixed empty application list when mass update template items
ja: [ZBX-1598] テンプレートアイテムの一括更新時にアプリケーションのリストが空白になる問題を修正

source: Two new options (ALL, ANY) can be used to control filtering on API level.
ja: 2つの新しいオプション(ALL, ANY)はAPIレベルでのフィルタリング制御に利用できます。

source: [ZBX-3472] changed item and discovery rule form to display SSH and SNMPv3 auth fields correctly when changing item type
ja: [ZBX-3472] アイテムとディスカバリルール画面でアイテムのタイプ変更した際にSSHとSNMPv3の認証フィールドを正しく表示するよう変更

source: fixed graph items limitation for IE6
ja: IE6用のグラフアイテムの制限を修正

source: fixed setting trigger status to unknown on trigger update, now only if expression is changed
ja: 条件式を変更した際のトリガーアップデート中にステータスが不明になる問題を修正

source: [ZBX-1790] restored support of the hyphen (-) in item key names
ja: [ZBX-1790] アイテムのキーの名前にハイフン(-)を使用できるように修正

source: [ZBX-2092] fixed label line height in maps, now all lines have the same line height
ja: [ZBX-2092] マップ上の全てのラベルの行が同じ高さになるように修正

source: [ZBX-3563] fixed host group filter in graph selection popup
ja: [ZBX-3563] グラフ選択ポップアップ内のホストグループのフィルタを修正

source: [ZBX-110] all phrases "slideshow" replaced by "slide show"
ja: [ZBX-110] 「slideshow」の文字列を「slide show」に変更

source: [DEV-333,ZBX-1254] fixed queue screen with separated availability of SNMP,IPMI and others items
ja: [DEV-333,ZBX-1254] SNMP、IPMIやその他のアイテムごとの可用性で分割されたキュー画面の問題を修正

source: [ZBX-2361] fixed item keys in the default template "Template_Netscreen_25"
ja: [ZBX-2361] デフォルトのテンプレート「Template_Netscreen_25」のアイテムのキーを修正

source: Improved performance of trigger evaluation
ja: トリガー評価のパフォーマンスの改善

source: [ZBX-825] fixed problem with changing item status in configuration web and items screens
ja: [ZBX-825] ウェブとアイテム設定画面のアイテムの状態を変更する際の問題を修正

source: [ZBX-1878] reverted map label background drawing
ja: [ZBX-1878] マップのラベルの背景の描画を以前の処理に修正

source: [ZBX-2045] fixed trigger editor not preserving element ordering
ja: [ZBX-2045] トリガーエディタが要素の順番を保たない問題を修正

source: This document contains the release notes for Zabbix 1.8.8rc1.
ja: このドキュメントはZabbix 1.8.8rc1のリリースノートを含みます。

source: [ZBX-1395] fixed map elements highlighting option
ja: [ZBX-1395] マップの要素のハイライト オプションを修正

source: [ZBX-2954] fixed translations in template delete popups
ja: [ZBX-2954] テンプレート削除ポップアップ内の翻訳を修正

source: [ZBX-2928] fixed "triggers info" unknown counter, added not classified triggers count
ja: [ZBX-2928] 「トリガー情報」画面の不明なトリガー数の誤りを修正し、未分類のトリガーが表示されない問題を修正

source: [ZBX-3384] fixed server crash in a distributed monitoring setup with PostgreSQL
ja: [ZBX-3384] PostgreSQL利用時に分散監視のセットアップでサーバがクラッシュする問題を修正

source: [ZBX-3201] fixed evaluation of calculated items with multiline expressions
ja: [ZBX-3201] 複数行の式を利用した計算アイテムの評価を修正

source: This release fixes numerous issues of Zabbix 1.8.x as well as 1.8.3rc1 and introduces new interesting features.
ja: このリリースにはZabbix 1.8.xと1.8.3rc1のいくつかの修正と新機能の紹介が含まれます。

source: Custom trigger severities
ja: トリガー重要度のカスタマイズ

source: [ZBX-593] fixed stop escalations if action is disabled
ja: [ZBX-593] アクションが無効状態の場合にエスカレーションを停止するように修正

source: [ZBX-2949] fixed Templates screen Go action 'Delete'
ja: [ZBX-2949] テンプレート画面で実行が「削除」となっていた問題を修正

source: Commercial support, Training and Sponsored Development
ja: 商用サポート、トレーニング、スポンサー開発

source: fixed PostgreSQL error in synchronization of graphs
ja: グラフの同期の際のPostgreSQLのエラーを修正

source: [ZBX-2296] fixed possible heavy loaded server crash when using internal checks
ja: [ZBX-2296] インターナルチェックを利用する場合に高負荷によるサーバクラッシュの可能性がある問題を修正

source: See Zabbix Manualfor a detailed upgrade procedure.
ja: 詳細なアップグレード手順はZabbixマニュアルを参照してください。

source: [ZBX-1357] updated French translation; thanks to alixen
ja: [ZBX-1357] フランス語訳を更新; alixenに感謝

source: ZABBIX supports monitoring of IPMI parameters and manual execution of IMPI commands from its front-end as well as remote commands.
ja: ZABBIXはIPMIパラメータのモニタリングをサポートし、ZABBIXフロントエンドからリモートコマンドと同様にIPMIコマンドを手動で実行することができます。

source: [ZBX-3845] check, if this user group is used in the config, if so it cannot be deleted
ja: [ZBX-3845] ユーザグループが設定で利用されている場合に削除できないようチェックを追加

source: [ZBX-2067] fixed undefined variable errors in actions screen
ja: [ZBX-2067] アクション画面の定義されていない変数のエラーを修正

source: [ZBX-2040] annoying "double check" popups removed from copy to & mass update actions of items and triggers
ja: [ZBX-2040] アイテムやトリガーのコピーや一括更新の際に表示される「再確認」用のポップアップを削除

source: [ZBX-3104] fixed screen item "Parameter" field validation and some minor screen item bugs
ja: [ZBX-3104] スクリーンアイテムの「パラメータ」項目のバリデーションといくつかの小さなスクリーンのアイテムのバグを修正

source: added automatic selection first group and host in WEB monitoring
ja: Webモニタリングに最初のグループとホストの自動選択機能を追加

source: Nice zoom for graphs
ja: グラフの詳細な拡大

source: [ZBX-2268] denied creation of pie/exploded graphs with more than one sum item
ja: [ZBX-2268] 2つ以上の合計アイテムを持つ円グラフ/分解円グラフの作成を禁止

source: [ZBX-2763] fixed saving user profile
ja: [ZBX-2763] ユーザプロファイルの保存処理を修正
